tap "d12frosted/emacs-plus"

# for doom emacs
brew "coreutils"
brew "autoconf"
brew "wxwidgets"
brew "libxslt"
brew "fop"
brew "asdf"
# for doom emacs
brew "fd"
brew "fontconfig"
brew "git"
brew "git-lfs"
brew "grep"
brew "mas"
brew "node"
brew "ripgrep"
brew "yt-dlp"
brew "imagemagick"
brew "tree-sitter"
brew "d12frosted/emacs-plus/emacs-plus@30",
     args: ["with-imagemagick"]

cask "iterm2"

mas "Amphetamine", id: 937984704
mas "Tailscale", id: 1475387142
mas "Amazon Kindle", id: 302584613
mas "Xcode", id: 497799835
mas "Windows App", id: 1295203466
