tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "d12frosted/emacs-plus"

# for doom emacs
brew "coreutils"
brew "autoconf"
brew "openssl@1.1"
brew "wxwidgets"
brew "libxslt"
brew "fop"
brew "asdf"
# for doom emacs
brew "fd"
brew "fontconfig"
brew "git"
brew "git-lfs"
brew "grep"
brew "mas"
brew "node"
brew "ripgrep"
brew "yt-dlp"
brew "imagemagick"
brew "tree-sitter"
brew "d12frosted/emacs-plus/emacs-plus@29",
     args: ["with-imagemagick", "with-native-comp"]

cask "alt-tab"
cask "iterm2"
cask "rectangle"

mas "Amphetamine", id: 937984704
mas "Tailscale", id: 1475387142
mas "Kindle Classic", id: 405399194
mas "Xcode", id: 497799835
